---
kind: method
id: M:Autodesk.Revit.DB.FilterInverseRule.GetInnerRule
source: html/3efb775d-b129-0e0b-5f57-5290eb12fa43.htm
---
# Autodesk.Revit.DB.FilterInverseRule.GetInnerRule Method

Gets the rule being inverted.

## Syntax (C#)
```csharp
public FilterRule GetInnerRule()
```